smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW22D5/MKW22D5_registers.h
/*******************************************************************************
 * HW_CAU_DIRECT0 - Direct access register 0
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT0 - Direct access register 0 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct0
{
    uint32_t U;
    struct _hw_cau_direct0_bitfields
    {
        uint32_t CAU_DIRECT0b : 32;    /*!< [31:0] Direct register 0 */
    } B;
} hw_cau_direct0_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT0 register
 */
/*@{*/
#define HW_CAU_DIRECT0_ADDR(x)   ((uintptr_t)(x) + 0x0U)

#define HW_CAU_DIRECT0(x)        (*(__O hw_cau_direct0_t *) HW_CAU_DIRECT0_ADDR(x))
#define HW_CAU_DIRECT0_WR(x, v)  (HW_CAU_DIRECT0(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT0 bitfields
 */

/*!
 * @name Register CAU_DIRECT0, field CAU_DIRECT0[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT0_CAU_DIRECT0 (0U)    /*!< Bit position for CAU_DIRECT0_CAU_DIRECT0. */
#define BM_CAU_DIRECT0_CAU_DIRECT0 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT0_CAU_DIRECT0. */
#define BS_CAU_DIRECT0_CAU_DIRECT0 (32U)   /*!< Bit field size in bits for CAU_DIRECT0_CAU_DIRECT0. */

/*! @brief Format value for bitfield CAU_DIRECT0_CAU_DIRECT0. */
#define BF_CAU_DIRECT0_CAU_DIRECT0(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT0_CAU_DIRECT0) & BM_CAU_DIRECT0_CAU_DIRECT0)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT1 - Direct access register 1
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT1 - Direct access register 1 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct1
{
    uint32_t U;
    struct _hw_cau_direct1_bitfields
    {
        uint32_t CAU_DIRECT1b : 32;    /*!< [31:0] Direct register 1 */
    } B;
} hw_cau_direct1_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT1 register
 */
/*@{*/
#define HW_CAU_DIRECT1_ADDR(x)   ((uintptr_t)(x) + 0x4U)

#define HW_CAU_DIRECT1(x)        (*(__O hw_cau_direct1_t *) HW_CAU_DIRECT1_ADDR(x))
#define HW_CAU_DIRECT1_WR(x, v)  (HW_CAU_DIRECT1(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT1 bitfields
 */

/*!
 * @name Register CAU_DIRECT1, field CAU_DIRECT1[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT1_CAU_DIRECT1 (0U)    /*!< Bit position for CAU_DIRECT1_CAU_DIRECT1. */
#define BM_CAU_DIRECT1_CAU_DIRECT1 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT1_CAU_DIRECT1. */
#define BS_CAU_DIRECT1_CAU_DIRECT1 (32U)   /*!< Bit field size in bits for CAU_DIRECT1_CAU_DIRECT1. */

/*! @brief Format value for bitfield CAU_DIRECT1_CAU_DIRECT1. */
#define BF_CAU_DIRECT1_CAU_DIRECT1(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT1_CAU_DIRECT1) & BM_CAU_DIRECT1_CAU_DIRECT1)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT2 - Direct access register 2
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT2 - Direct access register 2 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct2
{
    uint32_t U;
    struct _hw_cau_direct2_bitfields
    {
        uint32_t CAU_DIRECT2b : 32;    /*!< [31:0] Direct register 2 */
    } B;
} hw_cau_direct2_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT2 register
 */
/*@{*/
#define HW_CAU_DIRECT2_ADDR(x)   ((uintptr_t)(x) + 0x8U)

#define HW_CAU_DIRECT2(x)        (*(__O hw_cau_direct2_t *) HW_CAU_DIRECT2_ADDR(x))
#define HW_CAU_DIRECT2_WR(x, v)  (HW_CAU_DIRECT2(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT2 bitfields
 */

/*!
 * @name Register CAU_DIRECT2, field CAU_DIRECT2[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT2_CAU_DIRECT2 (0U)    /*!< Bit position for CAU_DIRECT2_CAU_DIRECT2. */
#define BM_CAU_DIRECT2_CAU_DIRECT2 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT2_CAU_DIRECT2. */
#define BS_CAU_DIRECT2_CAU_DIRECT2 (32U)   /*!< Bit field size in bits for CAU_DIRECT2_CAU_DIRECT2. */

/*! @brief Format value for bitfield CAU_DIRECT2_CAU_DIRECT2. */
#define BF_CAU_DIRECT2_CAU_DIRECT2(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT2_CAU_DIRECT2) & BM_CAU_DIRECT2_CAU_DIRECT2)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT3 - Direct access register 3
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT3 - Direct access register 3 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct3
{
    uint32_t U;
    struct _hw_cau_direct3_bitfields
    {
        uint32_t CAU_DIRECT3b : 32;    /*!< [31:0] Direct register 3 */
    } B;
} hw_cau_direct3_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT3 register
 */
/*@{*/
#define HW_CAU_DIRECT3_ADDR(x)   ((uintptr_t)(x) + 0xCU)

#define HW_CAU_DIRECT3(x)        (*(__O hw_cau_direct3_t *) HW_CAU_DIRECT3_ADDR(x))
#define HW_CAU_DIRECT3_WR(x, v)  (HW_CAU_DIRECT3(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT3 bitfields
 */

/*!
 * @name Register CAU_DIRECT3, field CAU_DIRECT3[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT3_CAU_DIRECT3 (0U)    /*!< Bit position for CAU_DIRECT3_CAU_DIRECT3. */
#define BM_CAU_DIRECT3_CAU_DIRECT3 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT3_CAU_DIRECT3. */
#define BS_CAU_DIRECT3_CAU_DIRECT3 (32U)   /*!< Bit field size in bits for CAU_DIRECT3_CAU_DIRECT3. */

/*! @brief Format value for bitfield CAU_DIRECT3_CAU_DIRECT3. */
#define BF_CAU_DIRECT3_CAU_DIRECT3(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT3_CAU_DIRECT3) & BM_CAU_DIRECT3_CAU_DIRECT3)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT4 - Direct access register 4
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT4 - Direct access register 4 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct4
{
    uint32_t U;
    struct _hw_cau_direct4_bitfields
    {
        uint32_t CAU_DIRECT4b : 32;    /*!< [31:0] Direct register 4 */
    } B;
} hw_cau_direct4_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT4 register
 */
/*@{*/
#define HW_CAU_DIRECT4_ADDR(x)   ((uintptr_t)(x) + 0x10U)

#define HW_CAU_DIRECT4(x)        (*(__O hw_cau_direct4_t *) HW_CAU_DIRECT4_ADDR(x))
#define HW_CAU_DIRECT4_WR(x, v)  (HW_CAU_DIRECT4(x).U = (v))
/*@}*/

